In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([1,2,3,np.nan,2,4,5,np.nan])

In [3]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    2.0
5    4.0
6    5.0
7    NaN
dtype: float64

In [4]:
s.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
dtype: bool

In [5]:
s.dropna()

0    1.0
1    2.0
2    3.0
4    2.0
5    4.0
6    5.0
dtype: float64

In [6]:
df=pd.DataFrame([[1,2,3],[2,np.nan,5],[np.nan,6,7],[np.nan,np.nan,np.nan]])

In [7]:
df

     0    1    2
0  1.0  2.0  3.0
1  2.0  NaN  5.0
2  NaN  6.0  7.0
3  NaN  NaN  NaN

In [8]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [9]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  2.0  NaN  5.0
2  NaN  6.0  7.0

In [12]:
df.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  2.0  NaN  5.0
2  NaN  6.0  7.0

In [13]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [14]:
df.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  2.0  1.0  5.0
2  1.0  6.0  7.0
3  1.0  1.0  1.0

In [15]:
df.fillna({0:0,1:1,2:2,3:3})

     0    1    2
0  1.0  2.0  3.0
1  2.0  1.0  5.0
2  0.0  6.0  7.0
3  0.0  1.0  2.0

In [16]:
df

     0    1    2
0  1.0  2.0  3.0
1  2.0  NaN  5.0
2  NaN  6.0  7.0
3  NaN  NaN  NaN

In [17]:
df.fillna({0:0,1:1,2:2,3:3},inplace=True)

In [18]:
df

     0    1    2
0  1.0  2.0  3.0
1  2.0  1.0  5.0
2  0.0  6.0  7.0
3  0.0  1.0  2.0